[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:46:55
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode)}
-                    {...register("diningCommonsCode", {
-                        required: "DiningCommonsCode is required."
-                    })}
+                    {...register("diningCommonsCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /DiningCommonsCode is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:46:34
                     id="diningCommonsCode"
                     type="text"
                     isInvalid={Boolean(errors.diningCommonsCode)}
-                    {...register("diningCommonsCode", {
+                    {...register("", {
                         required: "DiningCommonsCode is required."
                     })}
killedBy: UCSBDiningCommonsMenuItemForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemForm.js:63:35
                     type="text"
                     isInvalid={Boolean(errors.name)}
                     {...register("name", {
-                        required: "Name is required."
+                        required: ""
                     })}
                 />
killedBy: UCSBDiningCommonsMenuItemForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Name is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
