[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbdiningcommonsmenuitem/edit/${cell.row.values.id}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbdiningcommonsmenuitem/edit/2"

Number of calls: 0

<html>
  <head />

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:38:9
             accessor: 'id', // accessor is the "key" in the data
         },
 
-        {
-            Header: 'Dining Commons Code',
-            accessor: 'diningCommonsCode',
-        },
+        {},
 
         {
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:39:21
         },
 
         {
-            Header: 'Dining Commons Code',
+            Header: "",
             accessor: 'diningCommonsCode',
         },
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Dining Commons Code. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:48:9
             accessor: 'name',
         },
         
-        {
-            Header: 'Station',
-            accessor: 'station',
-        }
+        {}
     ];
 
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:49:21
         },
         
         {
-            Header: 'Station',
+            Header: "",
             accessor: 'station',
         }
killedBy: UCSBDiningCommonsMenuItemTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Station. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.js:56:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, testIdPrefix));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, testIdPrefix));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, testIdPrefix));
     } 
 
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers, content and buttons for admin user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
