[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:3:63
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBDiningCommonsMenuItemCreatePage() {
-
-  // Stryker disable all : UCSBDiningCommonsMenuItem for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBDiningCommonsMenuItemCreatePage() {}
killedBy: UCSBDiningCommonsMenuItemCreatePage tests Renders expected content
statusReason: Error: UCSBDiningCommonsMenuItemCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
