[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (menuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post",
-    method: "POST",
-    params: {
-     diningCommonsCode: menuItem.diningCommonsCode,
-     name: menuItem.name,
-     station: menuItem.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:12:13
   const objectToAxiosParams = (menuItem) => ({
     url: "/api/ucsbdiningcommonsmenuitem/post",
     method: "POST",
-    params: {
-     diningCommonsCode: menuItem.diningCommonsCode,
-     name: menuItem.name,
-     station: menuItem.station
-    }
+    params: {}
   });
 
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "ortega",
-   "name": "Baked Pesto Pasta with Chicken",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.js:19:35
     }
   });
 
-  const onSuccess = (menuItem) => {
-    toast(`New Menu Item Created - id: ${menuItem.id} name: ${menuItem.name}`);
-  }
+  const onSuccess = (menuItem) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitem
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Menu Item Created - id: 1 name: Baked Pesto Pasta with Chicken"

Number of calls: 0
