[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:22:30
           []
       );
 
-  const createButton = () => {
-      if (hasRole(currentUser, "ROLE_ADMIN")) {
-          return (
-              <Button
-                  variant="primary"
-                  href="/ucsbdiningcommonsmenuitem/create"
-                  style={{ float: "right" }}
-              >
-                  Create Menu Item
-              </Button>
-          )
-      } 
-  }
+  const createButton = () => {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemIndexPage.js:23:47
       );
 
   const createButton = () => {
-      if (hasRole(currentUser, "ROLE_ADMIN")) {
-          return (
-              <Button
-                  variant="primary"
-                  href="/ucsbdiningcommonsmenuitem/create"
-                  style={{ float: "right" }}
-              >
-                  Create Menu Item
-              </Button>
-          )
-      } 
+      if (hasRole(currentUser, "ROLE_ADMIN")) {} 
   }
 
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Error: Unable to find an element with the text: /Create Menu Item/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav
